using System;
using System.Windows.Forms;
using System.IO;
using System.Diagnostics;
using Word = Microsoft.Office.Interop.Word;
using System.Collections.Generic;

namespace Mission
{
    static class Methods
    {
        /*Выбор валюты по стране для проживания*/
        static Dictionary<string, string> valuta = new Dictionary<string, string> {
            {"Российская Федерация", "Рубли" },
            {"Абхазия", "Доллары США" },
            {"Австралия", "Доллары США" },
            {"Австрия", "Доллары США" },
            {"Азербайджан (Баку)", "Доллары США" },
            {"Азербайджан", "Доллары США" },
            {"Албания", "Доллары США" },
            {"Алжир", "Доллары США" },
            {"Ангола", "Доллары США" },
            {"Андорра", "Евро" },
            {"Антигуа и Барбуда", "Доллары США" },
            {"Аргентина", "Доллары США" },
            {"Армения (Ереван)", "Доллары США" },
            {"Армения", "Доллары США" },
            {"Афганистан", "Доллары США" },
            {"Багамские острова", "Доллары США" },
            {"Бангладеш", "Доллары США" },
            {"Барбадос", "Доллары США" },
            {"Бахрейн", "Доллары США" },
            {"Белиз", "Доллары США" },
            {"Белоруссия (Минск)", "Доллары США" },
            {"Белоруссия", "Доллары США" },
            {"Бельгия", "Евро" },
            {"Бенин", "Доллары США" },
            {"Бермудские Острова", "Доллары США" },
            {"Болгария", "Доллары США" },
            {"Боливия", "Доллары США" },
            {"Босния и Герцеговина", "Доллары США" },
            {"Ботсвана", "Доллары США" },
            {"Бразилия", "Доллары США" },
            {"Бруней", "Доллары США" },
            {"Буркина -Фасо", "Доллары США" },
            {"Бурунди", "Доллары США" },
            {"Вануату", "Евро" },
            {"Великобритания (Лондон)", "Английские фунты стерлинги" },
            {"Великобритания", "Английские фунты стерлинги" },
            {"Венгрия", "Доллары США" },
            {"Венесуэла", "Доллары США" },
            {"Вьетнам", "Доллары США" },
            {"Габон", "Доллары США" },
            {"Гаити", "Доллары США" },
            {"Гайана", "Доллары США" },
            {"Гамбия", "Доллары США" },
            {"Гана", "Доллары США" },
            {"Гватемала", "Доллары США" },
            {"Гвинея", "Доллары США" },
            {"Республика", "Гвинея-Бисау Доллары США" },
            {"Германия", "Евро" },
            {"Гибралтар", "Доллары США" },
            {"Гондурас", "Доллары США" },
            {"Гренада", "Доллары США" },
            {"Греция", "Доллары США" },
            {"Грузия (Тбилиси)", "Доллары США" },
            {"Грузия", "Доллары США" },
            {"Дания", "Датские кроны" },
            {"Джибути", "Доллары США" },
            {"Содружество Доминики", "Доллары США" },
            {"Доминиканская республика", "Доллары США" },
            {"Египет", "Доллары США" },
            {"Замбия", "Доллары США" },
            {"Заморские территории Франции", "Евро" },
            {"Зимбабве", "Доллары США" },
            {"Израиль", "Доллары США" },
            {"Индия", "Доллары США" },
            {"Индонезия", "Доллары США" },
            {"Иордания", "Доллары США" },
            {"Ирак", "Доллары США" },
            {"Иран", "Доллары США" },
            {"Ирландия", "Евро" },
            {"Исландия", "Доллары США" },
            {"Испания", "Евро" },
            {"Италия", "Евро" },
            {"Йемен", "Доллары США" },
            {"Кабо -Верде", "Доллары США" },
            {"Казахстан (Алма-Ата и Астана)", "Доллары США" },
            {"Казахстан", "Доллары США" },
            {"Каймановы Острова", "Доллары США" },
            {"Камбоджа", "Доллары США" },
            {"Камерун", "Доллары США" },
            {"Канада", "Доллары США" },
            {"Катар", "Доллары США" },
            {"Кения", "Доллары США" },
            {"Кипр", "Доллары США" },
            {"Киргизия (Бишкек)", "Доллары США" },
            {"Киргизия", "Доллары США" },
            {"Республика Кирибати", "Доллары США" },
            {"Китай", "Доллары США" },
            {"Китай (Гонконг)", "Доллары США" },
            {"Китай (Тайвань)", "Доллары США" },
            {"Колумбия", "Доллары США" },
            {"Коморские Острова", "Доллары США" },
            {"Конго", "Доллары США" },
            {"Демократическая Республика Конго", "Доллары США" },
            {"Корейская Народно-Демократическая Республика", "Доллары США" },
            {"Республика Корея", "Доллары США" },
            {"Коста -Рика", "Доллары США" },
            {"Кот -д\'Ивуар", "Доллары США" },
            {"Куба", "Доллары США" },
            {"Кувейт", "Доллары США" },
            {"Лаос", "Доллары США" },
            {"Латвия (Рига)", "Доллары США" },
            {"Латвия", "Доллары США" },
            {"Лесото", "Доллары США" },
            {"Либерия", "Доллары США" },
            {"Ливан", "Доллары США" },
            {"Ливия", "Доллары США" },
            {"Литва (Вильнюс)", "Доллары США" },
            {"Литва", "Доллары США" },
            {"Лихтенштейн", "Доллары США" },
            {"Люксембург", "Евро" },
            {"Маврикий", "Доллары США" },
            {"Мавритания", "Доллары США" },
            {"Мадагаскар", "Доллары США" },
            {"Макао", "Доллары США" },
            {"Македония", "Доллары США" },
            {"Малави", "Доллары США" },
            {"Малайзия", "Доллары США" },
            {"Мали", "Доллары США" },
            {"Мальдивы", "Доллары США" },
            {"Мальта", "Доллары США" },
            {"Марокко", "Доллары США" },
            {"Мексика", "Доллары США" },
            {"Мозамбик", "Доллары США" },
            {"Молдавия (Кишинев)", "Доллары США" },
            {"Молдавия", "Доллары США" },
            {"Монако", "Доллары США" },
            {"Монголия", "Доллары США" },
            {"Мьянма", "Доллары США" },
            {"Намибия", "Доллары США" },
            {"Науру", "Доллары США" },
            {"Непал", "Доллары США" },
            {"Нигер", "Доллары США" },
            {"Нигерия", "Доллары США" },
            {"Нидерланды", "Евро" },
            {"Никарагуа", "Доллары США" },
            {"Новая Зеландия", "Доллары США" },
            {"Новая Каледония", "Доллары США" },
            {"Норвегия", "Норвежские кроны" },
            {"Объединенные Арабские Эмират", "Доллары США" },
            {"Оман", "Доллары США" },
            {"Пакистан", "Доллары США" },
            {"Палау, остров", "Доллары США" },
            {"Палестина", "Доллары США" },
            {"Панама", "Доллары США" },
            {"Папуа -Новая Гвинея", "Доллары США" },
            {"Парагвай", "Доллары США" },
            {"Перу", "Доллары США" },
            {"Польша", "Доллары США" },
            {"Португалия", "Доллары США" },
            {"Пуэрто -Рико", "Доллары США" },
            {"Руанда", "Доллары США" },
            {"Румыния", "Доллары США" },
            {"Сальвадор", "Доллары США" },
            {"Самоа", "Доллары США" },
            {"Сан -Марино", "Евро" },
            {"Сан -Томе и Принсипи", "Доллары США" },
            {"Саудовская Аравия", "Доллары США" },
            {"Свазиленд", "Доллары США" },
            {"Сейшельские Острова", "Доллары США" },
            {"Сенегал", "Доллары США" },
            {"Сент -Люсия", "Доллары США" },
            {"Сербия и Черногория", "Доллары США" },
            {"Сингапур", "Доллары США" },
            {"Сирия", "Доллары США" },
            {"Словакия", "Доллары США" },
            {"Словения", "Доллары США" },
            {"Соломоновы Острова", "Доллары США" },
            {"Сомали", "Доллары США" },
            {"Судан", "Доллары США" },
            {"Суринам", "Доллары США" },
            {"США (Нью-Йорк)", "Доллары США" },
            {"США", "Доллары США" },
            {"Сьерра -Леоне", "Доллары США" },
            {"Таджикистан (Душанбе)", "Доллары США" },
            {"Таджикистан", "Доллары США" },
            {"Таиланд", "Доллары США" },
            {"Танзания", "Доллары США" },
            {"Того", "Доллары США" },
            {"Тонга", "Доллары США" },
            {"Тринидад и Тобаго", "Доллары США" },
            {"Тунис", "Доллары США" },
            {"Туркменистан (Ашхабад)", "Доллары США" },
            {"Туркменистан", "Доллары США" },
            {"Турция", "Доллары США" },
            {"Уганда", "Доллары США" },
            {"Узбекистан (Ташкент)", "Доллары США" },
            {"Узбекистан", "Доллары США" },
            {"Украина (Киев)", "Доллары США" },
            {"Украина", "Доллары США" },
            {"Уругвай", "Доллары США" },
            {"Фиджи", "Доллары США" },
            {"Филиппины", "Доллары США" },
            {"Финляндия", "Евро" },
            {"Франция", "Евро" },
            {"Хорватия", "Доллары США" },
            {"Центрально -Африканская Республика", "Доллары США" },
            {"Чад", "Доллары США" },
            {"Чехия", "Доллары США" },
            {"Чили", "Доллары США" },
            {"Швейцария", "Швейцарские франки" },
            {"Швеция", "Шведские кроны" },
            {"Шри -Ланка", "Доллары США" },
            {"Эквадор", "Доллары США" },
            {"Экваториальная Гвинея", "Доллары США" },
            {"Эритрея", "Доллары США" },
            {"Эстония (Таллин)", "Доллары США" },
            {"Эстония", "Доллары США" },
            {"Эфиопия", "Доллары США" },
            {"Южная Осетия", "Доллары США" },
            {"Южно -Африканская Республика", "Доллары США" },
            {"Ямайка", "Доллары США" },
            {"Япония", "Японские иены" }
        };
        /*Предельная норма возмещения по проживанию*/
        static Dictionary<string, int> dayCash = new Dictionary<string, int>
        {
            { "Российская Федерация", 2500 },
            { "Абхазия", 95 },
            { "Австралия", 130 },
            { "Австрия", 120 },
            { "Азербайджан (Баку)", 75 },
            { "Азербайджан", 60 },
            { "Албания", 150 },
            { "Алжир", 85 },
            { "Ангола", 140 },
            { "Андорра", 140 },
            { "Антигуа и Барбуда", 100 },
            { "Аргентина", 130 },
            { "Армения (Ереван)", 110 },
            { "Армения", 80 },
            { "Афганистан", 100 },
            { "Багамские острова", 100 },
            { "Бангладеш", 100 },
            { "Барбадос", 100 },
            { "Бахрейн", 90 },
            { "Белиз", 100 },
            { "Белоруссия (Минск)", 120 },
            { "Белоруссия", 80 },
            { "Бельгия", 150 },
            { "Бенин", 95 },
            { "Бермудские Острова", 100 },
            { "Болгария", 110 },
            { "Боливия", 80 },
            { "Босния и Герцеговина", 110 },
            { "Ботсвана", 120 },
            { "Бразилия", 160 },
            { "Бруней", 100 },
            { "Буркина-Фасо", 140 },
            { "Бурунди", 100 },
            { "Вануату", 120 },
            { "Великобритания (Лондон)", 120 },
            { "Великобритания", 100 },
            { "Венгрия", 100 },
            { "Венесуэла", 100 },
            { "Вьетнам", 100 },
            { "Габон", 130 },
            { "Гаити", 80 },
            { "Гайана", 110 },
            { "Гамбия",  110 },
            { "Гана", 110 },
            { "Гватемала", 90 },
            { "Гвинея", 150 },
            { "Республика Гвинея-Бисау", 50 },
            { "Германия", 200 },
            { "Гибралтар", 60 },
            { "Гондурас", 60 },
            { "Гренада", 70 },
            { "Греция", 120 },
            { "Грузия (Тбилиси)", 95 },
            { "Грузия", 80 },
            { "Дания", 1300 },
            { "Джибути", 100 },
            { "Содружество Доминики", 80 },
            { "Доминиканская республика", 130 },
            { "Египет", 120 },
            { "Замбия", 155 },
            { "Заморские территории Франции", 130 },
            { "Зимбабве", 130 },
            { "Израиль", 100 },
            { "Индия", 100 },
            { "Индонезия", 110 },
            { "Иордания", 60 },
            { "Ирак", 100 },
            { "Иран", 110 },
            { "Ирландия ", 150 },
            { "Исландия", 160 },
            { "Испания", 140 },
            { "Италия", 150 },
            { "Йемен", 100 },
            { "Кабо-Верде", 70 },
            { "Казахстан (Алма-Ата и Астана)", 100 },
            { "Казахстан", 70 },
            { "Каймановы Острова", 130 },
            { "Камбоджа", 120 },
            { "Камерун", 100 },
            { "Канада", 130 },
            { "Катар", 120 },
            { "Кения", 120 },
            { "Кипр", 140 },
            { "Киргизия (Бишкек)", 100 },
            { "Киргизия", 70 },
            { "Республика Кирибати", 130 },
            { "Китай", 120 },
            { "Китай (Гонконг)", 120 },
            { "Китай (Тайвань)", 120 },
            { "Колумбия", 90 },
            { "Коморские Острова", 150 },
            { "Конго", 120 },
            { "Демократическая Республика Конго", 100 },
            { "Корейская Народно-Демократическая Республика", 170 },
            { "Республика Корея", 180 },
            { "Коста-Рика", 90 },
            { "Кот-д\'Ивуар", 110 },
            { "Куба", 100 },
            { "Кувейт", 120 },
            { "Лаос", 100 },
            { "Латвия (Рига)", 120 },
            { "Латвия", 65 },
            { "Лесото", 100 },
            { "Либерия", 115 },
            { "Ливан", 60 },
            { "Ливия", 100 },
            { "Литва (Вильнюс)", 130 },
            { "Литва", 115 },
            { "Лихтенштейн", 150 },
            { "Люксембург", 90 },
            { "Маврикий", 100 },
            { "Мавритания", 120 },
            { "Мадагаскар", 120 },
            { "Макао", 100 },
            { "Македония", 150 },
            { "Малави", 90 },
            { "Малайзия", 120 },
            { "Мали", 140 },
            { "Мальдивы", 100 },
            { "Мальта", 100 },
            { "Марокко", 120 },
            { "Мексика", 100 },
            { "Мозамбик", 100 },
            { "Молдавия (Кишинев)", 90 },
            { "Молдавия", 50 },
            { "Монако", 150 },
            { "Монголия", 90 },
            { "Мьянма", 80 },
            { "Намибия", 140 },
            { "Науру", 130 },
            { "Непал", 85 },
            { "Нигер", 150 },
            { "Нигерия", 150 },
            { "Нидерланды", 200 },
            { "Никарагуа", 90 },
            { "Новая Зеландия", 130 },
            { "Новая Каледония", 100 },
            { "Норвегия", 1055 },
            { "Объединенные Арабские Эмират", 155 },
            { "Оман", 110 },
            { "Пакистан", 120 },
            { "Палау, остров", 150 },
            { "Палестина", 100 },
            { "Панама", 100 },
            { "Папуа-Новая Гвинея", 120 },
            { "Парагвай", 70 },
            { "Перу", 110 },
            { "Польша", 95 },
            { "Португалия", 95 },
            { "Пуэрто-Рико", 170 },
            { "Руанда", 120 },
            { "Румыния", 130 },
            { "Сальвадор", 90 },
            { "Самоа", 90 },
            { "Сан-Марино", 150 },
            { "Сан-Томе и Принсипи", 100 },
            { "Саудовская Аравия", 100 },
            { "Свазиленд", 110 },
            { "Сейшельские Острова", 170 },
            { "Сенегал", 130 },
            { "Сент-Люсия", 100 },
            { "Сербия и Черногория", 95 },
            { "Сингапур", 170 },
            { "Сирия", 100 },
            { "Словакия", 100 },
            { "Словения", 130 },
            { "Соломоновы Острова", 120 },
            { "Сомали", 100 },
            { "Судан", 160 },
            { "Суринам", 130 },
            { "США (Нью-Йорк)", 350 },
            { "США", 260 },
            { "Сьерра-Леоне", 150 },
            { "Таджикистан (Душанбе)", 100 },
            { "Таджикистан", 80 },
            { "Таиланд", 140 },
            { "Танзания", 110 },
            { "Того", 90 },
            { "Тонга", 115 },
            { "Тринидад и Тобаго", 110 },
            { "Тунис", 95 },
            { "Туркменистан (Ашхабад)", 50 },
            { "Туркменистан", 35 },
            { "Турция", 120 },
            { "Уганда", 100 },
            { "Узбекистан (Ташкент)", 100 },
            { "Узбекистан", 40 },
            { "Украина (Киев)", 150 },
            { "Украина", 100 },
            { "Уругвай", 70 },
            { "Фиджи", 70 },
            { "Филиппины", 150 },
            { "Финляндия", 180 },
            { "Франция", 185 },
            { "Хорватия", 120 },
            { "Центрально-Африканская Республика", 100 },
            { "Чад", 170 },
            { "Чехия", 140 },
            { "Чили", 90 },
            { "Швейцария", 270 },
            { "Швеция", 2000 },
            { "Шри-Ланка", 70 },
            { "Эквадор", 75 },
            { "Экваториальная Гвинея", 110 },
            { "Эритрея", 70 },
            { "Эстония (Таллин)", 120 },
            { "Эстония", 60 },
            { "Эфиопия", 100 },
            { "Южная Осетия", 95 },
            { "Южно-Африканская Республика", 100 },
            { "Ямайка", 130 },
            { "Япония", 24000 }
        };
        /*Предельная норма возмещения по суточным*/
        static Dictionary<string, int> sutCash = new Dictionary<string, int>
        {
            { "Российская Федерация", 700 },
            { "Абхазия", 54 },
            { "Австралия", 60 },
            { "Австрия", 66 },
            { "Азербайджан (Баку)", 57 },
            { "Азербайджан", 57 },
            { "Албания", 67 },
            { "Алжир", 65 },
            { "Ангола", 80 },
            { "Андорра", 62 },
            { "Антигуа и Барбуда", 69 },
            { "Аргентина", 64 },
            { "Армения (Ереван)", 57 },
            { "Армения", 57 },
            { "Афганистан", 80 },
            { "Багамские острова", 64 },
            { "Бангладеш", 67 },
            { "Барбадос", 68 },
            { "Бахрейн", 66 },
            { "Белиз", 59 },
            { "Белоруссия (Минск)", 57 },
            { "Белоруссия", 57 },
            { "Бельгия", 64 },
            { "Бенин", 66 },
            { "Бермудские Острова",  69 },
            { "Болгария", 55 },
            { "Боливия", 63 },
            { "Босния и Герцеговина", 60 },
            { "Ботсвана", 64 },
            { "Бразилия", 58 },
            { "Бруней", 57 },
            { "Буркина-Фасо", 72 },
            { "Бурунди", 74 },
            { "Вануату", 68 },
            { "Великобритания (Лондон)", 69 },
            { "Великобритания", 69 },
            { "Венгрия", 61 },
            { "Венесуэла", 64 },
            { "Вьетнам", 63 },
            { "Габон", 70 },
            { "Гаити", 61 },
            { "Гайана", 67 },
            { "Гамбия", 62 },
            { "Гана", 66 },
            { "Гватемала", 68 },
            { "Гвинея", 66 },
            { "Республика Гвинея-Бисау", 91 },
            { "Германия", 65 },
            { "Гибралтар", 69 },
            { "Гондурас", 75 },
            { "Гренада", 92 },
            { "Греция", 58 },
            { "Грузия (Тбилиси)", 54 },
            { "Грузия", 54 },
            { "Дания", 70 },
            { "Джибути", 75 },
            { "Содружество Доминики", 69 },
            { "Доминиканская республика", 59 },
            { "Египет", 60 },
            { "Замбия", 68 },
            { "Заморские территории Франции", 65 },
            { "Зимбабве", 57 },
            { "Израиль", 70 },
            { "Индия", 62 },
            { "Индонезия", 69 },
            { "Иордания", 62 },
            { "Ирак", 81 },
            { "Иран", 62 },
            { "Ирландия", 65 },
            { "Исландия", 70 },
            { "Испания", 62 },
            { "Италия", 65 },
            { "Йемен", 66 },
            { "Кабо-Верде", 64 },
            { "Казахстан  (Алма-Ата и Астана)", 55 },
            { "Казахстан", 55 },
            { "Каймановы Острова", 69 },
            { "Камбоджа", 68 },
            { "Камерун", 69 },
            { "Канада", 62 },
            { "Катар", 58 },
            { "Кения", 66 },
            { "Кипр", 59 },
            { "Киргизия (Бишкек)", 56 },
            { "Киргизия", 56 },
            { "Республика Кирибати", 75 },
            { "Китай", 67 },
            { "Китай (Гонконг)", 67 },
            { "Китай (Тайвань)", 67 },
            { "Колумбия", 65 },
            { "Коморские Острова", 86 },
            { "Конго", 85 },
            { "Демократическая Республика Конго", 76 },
            { "Корейская Народно-Демократическая Республика", 65 },
            { "Республика Корея", 66 },
            { "Коста-Рика", 63 },
            { "Кот-д'Ивуар", 74 },
            { "Куба", 65 },
            { "Кувейт", 59 },
            { "Лаос", 64 },
            { "Латвия (Рига)", 55 },
            { "Латвия", 55 },
            { "Лесото", 61 },
            { "Либерия", 78 },
            { "Ливан", 73 },
            { "Ливия", 70 },
            { "Литва (Вильнюс)", 57 },
            { "Литва", 57 },
            { "Лихтенштейн", 71 },
            { "Люксембург", 61 },
            { "Маврикий", 63 },
            { "Мавритания", 67 },
            { "Мадагаскар", 64 },
            { "Макао", 67 },
            { "Македония", 60 },
            { "Малави", 66 },
            { "Малайзия", 60 },
            { "Мали", 70 },
            { "Мальдивы", 67 },
            { "Мальта", 61 },
            { "Марокко", 58 },
            { "Мексика", 64 },
            { "Мозамбик", 68 },
            { "Молдавия (Кишинев)", 53 },
            { "Молдавия", 53 },
            { "Монако", 65 },
            { "Монголия", 59 },
            { "Мьянма", 65 },
            { "Намибия", 61 },
            { "Науру", 60 },
            { "Непал", 65 },
            { "Нигер", 78 },
            { "Нигерия", 72 },
            { "Нидерланды", 65 },
            { "Никарагуа", 68 },
            { "Новая Зеландия", 65 },
            { "Новая Каледония", 60 },
            { "Норвегия", 79 },
            { "Объединенные Арабские Эмират", 60 },
            { "Оман", 62 },
            { "Пакистан", 69 },
            { "Палау, остров", 63 },
            { "Палестина", 70 },
            { "Панама", 64 },
            { "Папуа-Новая Гвинея", 68 },
            { "Парагвай", 57 },
            { "Перу", 63 },
            { "Польша", 56 },
            { "Португалия", 61 },
            { "Пуэрто-Рико", 72 },
            { "Руанда", 72 },
            { "Румыния", 56 },
            { "Сальвадор", 68 },
            { "Самоа", 64 },
            { "Сан-Марино", 65 },
            { "Сан-Томе и Принсипи", 74 },
            { "Саудовская Аравия", 64 },
            { "Свазиленд", 65 },
            { "Сейшельские Острова", 71 },
            { "Сенегал", 70 },
            { "Сент-Люсия", 69 },
            { "Сербия и Черногория", 60 },
            { "Сингапур", 61 },
            { "Сирия", 62 },
            { "Словакия", 59 },
            { "Словения", 57 },
            { "Соломоновы Острова", 56 },
            { "Сомали", 70 },
            { "Судан", 78 },
            { "Суринам", 69 },
            { "США (Нью-Йорк)", 72 },
            { "США", 72 },
            { "Сьерра-Леоне", 69 },
            { "Таджикистан (Душанбе)", 60 },
            { "Таджикистан", 60 },
            { "Таиланд", 58 },
            { "Танзания", 66 },
            { "Того", 65 },
            { "Тонга", 54 },
            { "Тринидад и Тобаго", 68 },
            { "Тунис", 60 },
            { "Туркменистан (Ашхабад)", 65 },
            { "Туркменистан", 65 },
            { "Турция", 64 },
            { "Уганда", 65 },
            { "Узбекистан (Ташкент)", 59 },
            { "Узбекистан", 59 },
            { "Украина (Киев)", 53 },
            { "Украина", 53 },
            { "Уругвай", 60 },
            { "Фиджи", 61 },
            { "Филиппины", 63 },
            { "Финляндия", 62 },
            { "Франция", 65 },
            { "Хорватия", 63 },
            { "Центрально-Африканская Республика", 90 },
            { "Чад", 95 },
            { "Чехия", 60 },
            { "Чили", 63 },
            { "Швейцария", 71 },
            { "Швеция", 65 },
            { "Шри-Ланка", 62 },
            { "Эквадор", 67 },
            { "Экваториальная Гвинея", 79 },
            { "Эритрея", 68 },
            { "Эстония (Таллин)", 55 },
            { "Эстония", 55 },
            { "Эфиопия", 70 },
            { "Южная Осетия", 54 },
            { "Южно-Африканская Республика", 58 },
            { "Ямайка", 69 },
            { "Япония", 83 }
        };

        /*************************** курсы валют  ******************************/
        static public Dictionary<string, double> courseVal = new Dictionary<string, double>
        {
            {"Английские фунты стерлинги",  90d },
            {"Датские кроны", 10d },
            {"Доллары США", 65d },
            {"Евро", 73d },
            {"Норвежские кроны", 8d },
            {"Рубли", 1d},
            {"Шведские кроны", 7d},
            {"Швейцарские франки", 67d},
            {"Японские иены", 0.6}
        };

        /* Итого Словарь ключ=название валюты, значение = сумма расходов по данной валюте в единицах валюты */
        //Если не находим нужную валюту созданем новый элемент, если находим увеличиваем значение
        static public Dictionary<string, double> SumValuta = new Dictionary<string, double>();


        static public string getValuta(string country)
        {
            return valuta[country];
        }

        static public int getDayCash(string country)
        {
            return dayCash[country];
        }

        static public int getSutCash(string country)
        {
            return sutCash[country];
        }

        static public string getValutaSut(string country)
        {
            return country == "Российская Федерация" ? "Рубли" : "Доллары США";
        }

        /// <summary>
        /// Создание документа Word путем замены массива шаблонов на значения из массива замены
        /// </summary>
        /// <param name="FindText">Массив с шаблонами</param>
        /// <param name="ReplaceWith">Массив со значениями для замены</param>
        /// <param name="PathMy">Путь и имя Word документа по образцу которого будет создаваться необходимый документ</param>
        /// <returns>Возвращает True если метод выполнился до конца</returns>
        static public bool replaceNote(string[] FindText, string[] ReplaceWith, string PathMy)
        {
            /* Создаем приложение Word */
            Word.Application app = new Word.Application();


            /* Переменная для документа */
            Word.Document doc = new Word.Document();

            /* Объекты обертки */
            //Получаем каталог откуда запущено приложение
            string pathDoc = Path.GetFullPath(Application.StartupPath);

            //Формируем путь к шаблону Справки
            object fileName = pathDoc + PathMy;
            //object falseValue = false;
            //object trueValue = true;
            object missing = Type.Missing;

            doc = app.Documents.Add(fileName, ref missing, ref missing, ref missing);

            app.Selection.Find.ClearFormatting();
            app.Selection.Find.Replacement.ClearFormatting();

            object replace = Word.WdReplace.wdReplaceAll;
            object FT;
            object RW;
            for (int i =0; i<FindText.Length; i++)
            {
                // Осуществляем замену  
                FT= FindText[i]; 
                RW= ReplaceWith[i];
                try
                {
                    app.Selection.Find.Execute(ref FT, ref missing, ref missing, ref missing,
                       ref missing, ref missing, ref missing, ref missing, ref missing, ref RW,
                       ref replace, ref missing, ref missing, ref missing, ref missing);
                }
                catch (Exception e)
                {
                    Debug.WriteLine(e.Message);
                }
                                    
            }
            app.Visible = true;
            return true;
        }


        /// <summary>
        /// расчет суточных в стране
        /// </summary>
        /// <param name="cBoxCountry">Наименование страны</param>
        /// <param name="comboBoxBonus1">Условия принимающей стороны 1</param>
        /// <param name="comboBoxBonus2">Условия принимающей стороны 2</param>
        /// /// <param name="duration">Продолжительность пребывания в стране</param>
        /// <returns>Суточная стоимость пребывание в стране</returns>
        static public string Sutochnie(ComboBox cBoxCountry, ComboBox comboBoxBonus1, ComboBox comboBoxBonus2, int duration)
        {
            
            //возвращает валюту по названию страны
            string val = (cBoxCountry.Text == "") ? "" : Methods.getValutaSut(cBoxCountry.Text);
            double price_Double;
            /*Стоимость проживания в стране*/
            //если страна не выбрана стоимость = 0
            if (val == "")
            {
                price_Double = 0;
            }
            else
            {
                //иначе если принимающая сторона оплачивает суточные или берет все расходы на себя, стоимость так же 0
                if (comboBoxBonus1.Text == "Суточные" ||
                    comboBoxBonus2.Text == "Все расходы" ||
                    comboBoxBonus2.Text == "Проживание, суточные" ||
                    comboBoxBonus2.Text == "Суточные" ||
                    comboBoxBonus2.Text == "Суточные, виза" ||
                    comboBoxBonus2.Text == "Суточные, мед страховка" ||
                    comboBoxBonus2.Text == "Суточные, трансфер")
                {
                    price_Double = 0;
                }
                else
                {
                    if (cBoxCountry.Text == "Российская Федерация")
                    {
                        // иначе если едем в РФ и расходы принимающая сторона на себя не берет?
                        // стоимость одного дня составит 700, 
                        // если берет то 0
                        price_Double = (comboBoxBonus1.Text == "Нет") ? 700d : 0;
                    }
                    else
                    {
                        //если мы не в РФ и принимающая сторона ничего не оплачивает, берем полуную стоимость проживания = 1
                        //если оплачивает питание, визу, проживание, страховку то лишь 1/3 стоимости
                        //иначе все расходы на принимающей стороне коэф равен 0
                        price_Double = (comboBoxBonus1.Text == "Нет")
                                        ? 1d
                                        : (comboBoxBonus1.Text == "Питание" ||
                                            comboBoxBonus1.Text == "Питание, виза" ||
                                            comboBoxBonus1.Text == "Питание, мед страховка" ||
                                            comboBoxBonus1.Text == "Питание, проезд" ||
                                            comboBoxBonus1.Text == "Питание, проживание" ||
                                            comboBoxBonus1.Text == "Питание, трансфер")
                                            ? 0.3
                                            : 0d;
                        //умножаем полученный коэффициент на стоимость одного дня получаем точную стоимость одного дня
                        price_Double *= Methods.getSutCash(cBoxCountry.Text);
                    }
                }
            }
            string price_Str = price_Double.ToString();
            //Получаем суммарную стоимость суточных в данной стране
            double sum_d = price_Double * duration;
            //Обновляем массив хранящий итоговый результат по каждой валюте
            if (Methods.SumValuta.ContainsKey(val))
            {
                Methods.SumValuta[val] += sum_d;
            }
            else
            {
                Methods.SumValuta.Add(val, sum_d);
            }
            //Переводим стоимость суток в строковый формат
            return sum_d.ToString();
        }
        
    }
}
